<template>
  <div class="d-flex flex-column justify-center">
    <div class="page-header">
      <v-container class="d-flex justify-space-between align-center">
        <h1>О нас</h1>
      </v-container>
    </div>
    <v-container class="page-main pb-0">
      <p>
        2011 год наша первая выставочная собака и первая выставка, тогда не было даже мысли о специальных средствах для животных,
        что за зверь такой – груминг, мы даже не подозревали. Помыв нашу собачку первым попавшимся под руку шампунем и получив
        вместо золотистого ретривера барашка, мы отправились на выставку, описание собаки до сих пор страшно перечитывать. С тех пор
        прошло не мало времени, десятки выставок за плечами, собака в семье далеко не одна (количество не буду озвучивать), появились
        и представители кошачьих, и проблема <b>выставочного груминга</b> и <b>повседневного груминга</b> стоит практически на первом месте. </p>
      <p class="pb-5 pt-5 text-center"><i>Какую
        выбрать марку косметики? Какую линию? Где достать?</i></p>
      <p> Эти проблемы стоят перед любым владельцем кошки или собаки не важно посещает
        она выставки или просто радует своим существованием семью. Желая облегчить Вам <b>выбор средств по уходу за животными</b> столкнулись
        не мы одни, мы решили создать для Вас интернет-магазин.
      </p>
      <p>Мы намерены представить в нашем магазине самые качественные, популярные и совершенно различные по цене <b>косметические средства для животных</b>
        и <b>средства по уходу за животными</b>. Наша цель - создать универсальный магазин, где каждый владелец сможет подобрать для своего питомца
        самое необходимое средство ухода.</p>
      <p>Если Ваше животное завсегдатай дог шоу, мы предложим Вам различные <b>выставочные аксессуары</b> – ринговки ручной работы,
        держатели для номера, шоу средства – все это поможет Вам и Вашему питомцу блистать в рингах.</p>
      <p>И это первый блок товаров, которые мы представляем на сайте.</p>
      <p>Вторым существенным блоком, предлагаемых нами товаров является <b>амуниция для животных</b>. Необходимый минимум для любой собаки - это ошейник и
        поводок, они могут прослужить всю жизнь, но мы предлагаем ассортимент товаров различной цветовой гаммы, материалов и размеров. У нас Вы сможете
        подобрать аксессуары и для миниатюрного Йоркширского терьера, и для внушительного Кане-корсо.</p>
      <p>Кроме того, в блок товаров с амуницей мы включили и линии амуниции для собак, хозяева которых увлекаются дрессировкой всерьез – рывковые
        цепочки, намордники и многое другое Вы сможете найти на нашем сайте.</p>
      <p>Мы намерены постоянно совершенствовать <b>Интернет-магазин аксессуаров для кошек и собак</b>, мы готовы открывать для Вас не представленные
        на нашем сайте марки косметики. Будем очень благодарны любой обратной связи с предложениями, отзывами и пожеланиями.</p>
      <div class="d-flex justify-center mt-15 about-img-container">
        <v-img class="about-img" contain :src="require('~/static/amunicia-dog.jpg')"></v-img>
      </div>
    </v-container>
  </div>
</template>

<script>
    export default {
      auth: false,
      name: "about"
    }
</script>

<style scoped lang="scss">
  @import "~/assets/default.scss";
  .page-header{
    h1{
      font-family: 'Montserrat Light', sans-serif;
    }
  }
  .about-img-container, .about-img{
    height: 300px;
  }
  .page-main{
    font-family: 'Montserrat', sans-serif;
    p{
      font-size: 18px;
      line-height: 30px;
      letter-spacing: 0.02em;
      margin: 15px 0;
    }
  }
  @media all and (max-width: 960px){
    .about-img-container,.about-img{
      height: 150px;
    }
  }
</style>
